In [1]:
# Importing necessary libraries
import pandas as pd 
import numpy as np

In [2]:
# reading the data
data=pd.read_csv('C:/Users/NC/Desktop/practice/worksheets/PYTHON-WORKSHEET-12/data.csv')

In [3]:
#displaying rows and columns
rows=data.shape[0]
columns=data.shape[1]
print('No. of rows in data :',rows)
print('No. of columns in data :',columns)

No. of rows in data : 23678
No. of columns in data : 21

In [4]:
# displaying data types
data.dtypes

Suburb            object
Address           object
Rooms            float64
Type              object
Price            float64
Method            object
SellerG           object
Date              object
Distance         float64
Postcode         float64
Bedroom2         float64
Bathroom         float64
Car              float64
Landsize         float64
BuildingArea     float64
YearBuilt        float64
CouncilArea       object
Lattitude        float64
Longtitude       float64
Regionname        object
Propertycount    float64
dtype: object

In [5]:
# Checking null values
data.isnull().sum()

Suburb             131
Address            131
Rooms              131
Type               131
Price             5282
Method             131
SellerG            131
Date               131
Distance           132
Postcode           132
Bedroom2          4612
Bathroom          4615
Car               4757
Landsize          6268
BuildingArea     13660
YearBuilt        12138
CouncilArea       8022
Lattitude         4435
Longtitude        4435
Regionname         132
Propertycount      132
dtype: int64

In [6]:
# def to find index of rows having all null values in that row
def null_row_index():
    index=[]
    for i in range(0,len(data)):
        count=0
        for col in data.columns:
            if data[col].isnull()[i]==1:
                count+=1
            else:
                count+=0
        if count==21:
             index.append(i)
    return index

In [7]:
k=null_row_index()

In [8]:
k

[31,
 1145,
 1348,
 2119,
 3277,
 3288,
 3745,
 3752,
 3798,
 3855,
 4089,
 4096,
 4164,
 4218,
 4222,
 4326,
 4649,
 4897,
 4942,
 5052,
 5223,
 5265,
 5328,
 5331,
 5383,
 5405,
 5625,
 5741,
 5952,
 6125,
 6133,
 6140,
 6143,
 6251,
 6326,
 6406,
 6446,
 6703,
 6717,
 6853,
 6921,
 7086,
 7261,
 7348,
 7596,
 7743,
 7759,
 7762,
 7775,
 8054,
 8095,
 8118,
 8190,
 8409,
 8501,
 8652,
 8816,
 8974,
 9098,
 9210,
 9232,
 9450,
 9455,
 9586,
 9761,
 9888,
 9894,
 10009,
 10125,
 10390,
 10475,
 10738,
 10952,
 11334,
 11348,
 11552,
 11755,
 12087,
 12441,
 12559,
 12997,
 13066,
 13381,
 13647,
 13725,
 14009,
 14471,
 14644,
 14963,
 15094,
 15214,
 15771,
 16044,
 16252,
 16563,
 16655,
 16848,
 17111,
 17246,
 17611,
 17741,
 18077,
 18148,
 18251,
 18374,
 18476,
 18547,
 18671,
 18742,
 18884,
 19001,
 19287,
 19641,
 19949,
 20087,
 20422,
 20496,
 20695,
 20838,
 20880,
 21055,
 21220,
 21343,
 21602,
 22003,
 22109,
 22288,
 22704,
 22918,
 23153,
 23341]

In [9]:
# Printing no. of empty rows and percentage 
print('Total no. of empty rows are:',len(k))
print('Percentage of missing rows in dataset is:',(len(k)/len(data)),'%')

Total no. of empty rows are: 131
Percentage of missing rows in dataset is: 0.005532561871779711 %

In [10]:
# Dropping rows having all nan values
data.dropna(how='all',inplace=True)

In [11]:
null_col=[]
for col in data.columns:
    if data[col].isnull().sum()>1:
        null_col.append(col)

In [12]:
# Printing columns having null values
print('columns having null values are:')
for col in null_col:
    print(col)

columns having null values are:
Price
Bedroom2
Bathroom
Car
Landsize
BuildingArea
YearBuilt
CouncilArea
Lattitude
Longtitude

In [13]:
# Printing column with null values and percentage null values
values=[]
percentage=[]
for col in null_col:
    values.append(data[col].isnull().sum())
    percentage.append(data[col].isnull().sum()/len(data[col]))

In [14]:
null_columns=pd.DataFrame({'Column':null_col,'Null values':values,'Percentage null':[x*100 for x in percentage]})

In [15]:
null_columns

         Column  Null values  Percentage null
0         Price         5151        21.875398
1      Bedroom2         4481        19.030025
2      Bathroom         4484        19.042766
3           Car         4626        19.645815
4      Landsize         6137        26.062768
5  BuildingArea        13529        57.455302
6     YearBuilt        12007        50.991634
7   CouncilArea         7891        33.511700
8     Lattitude         4304        18.278337
9    Longtitude         4304        18.278337

In [16]:
# printing index of rows having null values
missing_rows_index = data[data.isna().any(axis=1)].index

In [17]:
missing_rows_index

Int64Index([    0,     1,     3,     5,     7,     8,     9,    10,    12,
               13,
            ...
            23668, 23669, 23670, 23671, 23672, 23673, 23674, 23675, 23676,
            23677],
           dtype='int64', length=17351)

In [18]:
# Missing values in row and percentage missing value in that row
index=[]
values=[]
missing=[]
for i in missing_rows_index:
    count=0
    for col in data.columns:
        if data[col].isnull()[i]==1:
            count+=1
        else:
            count+=0
    index.append(i)
    values.append(count)
    missing.append(count/21)

In [19]:
null_rows=pd.DataFrame({'Index':index,'Missing Values':values,'Percentage missing':[x*100 for x in missing]})

In [20]:
null_rows

       Index  Missing Values  Percentage missing
0          0               3           14.285714
1          1               2            9.523810
2          3               3           14.285714
3          5               2            9.523810
4          7               1            4.761905
...      ...             ...                 ...
17346  23673               2            9.523810
17347  23674               8           38.095238
17348  23675               4           19.047619
17349  23676               1            4.761905
17350  23677               2            9.523810

[17351 rows x 3 columns]

In [21]:
#dropping column having more than 30% missing values 
for i,j in enumerate(null_columns['Percentage null']):
    if j>30:
        data.drop(null_columns['Column'][i],axis=1,inplace=True)

In [22]:
#printing rows having more than 5 null and percentage of that
val=[]
percent=[]
for i in range(len(null_rows)):
    if null_rows['Missing Values'][i]>5:
        val.append(null_rows['Missing Values'][i])
        percent.append(null_rows['Percentage missing'][i])

In [23]:
missing_row=pd.DataFrame({'Number':val,'Percentage':percent})

In [24]:
missing_row

      Number  Percentage
0          9   42.857143
1          9   42.857143
2          9   42.857143
3          9   42.857143
4          9   42.857143
...      ...         ...
4487       9   42.857143
4488       6   28.571429
4489       9   42.857143
4490       9   42.857143
4491       8   38.095238

[4492 rows x 2 columns]

In [25]:
#There are no rows having missing values more than 5 and percentage less than 20.

In [26]:
data.describe()

,Rooms,Price,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,Lattitude,Longtitude,Propertycount
count,23547.000000,1.839600e+04,23546.000000,23546.000000,19066.000000,19063.000000,18921.000000,17410.000000,19243.000000,19243.000000,23546.000000
mean,2.976048,1.056697e+06,10.306515,3109.782893,2.951956,1.570897,1.626235,551.783458,-37.812434,145.000287,7517.480591
std,0.974501,6.419217e+05,6.016318,94.522190,0.996032,0.712684,0.974048,3544.288014,0.079926,0.106071,4414.995634
min,1.000000,8.500000e+04,0.000000,3000.000000,0.000000,0.000000,0.000000,0.000000,-38.184180,144.431620,129.000000
25%,2.000000,6.330000e+05,6.200000,3047.000000,2.000000,1.000000,1.000000,181.000000,-37.859300,144.939300,4385.000000
50%,3.000000,8.800000e+05,9.500000,3101.000000,3.000000,1.000000,2.000000,448.000000,-37.809700,145.004300,6567.000000
75%,4.000000,1.302000e+06,13.000000,3150.000000,4.000000,2.000000,2.000000,656.000000,-37.759800,145.063100,10331.000000
max,12.000000,9.000000e+06,48.100000,3978.000000,30.000000,12.000000,26.000000,433014.000000,-37.407580,145.526350,21650.000000

In [27]:
# Printing percentage of null in column
data.isnull().sum()*100/len(data)

Suburb            0.000000
Address           0.000000
Rooms             0.000000
Type              0.000000
Price            21.875398
Method            0.000000
SellerG           0.000000
Date              0.000000
Distance          0.004247
Postcode          0.004247
Bedroom2         19.030025
Bathroom         19.042766
Car              19.645815
Landsize         26.062768
Lattitude        18.278337
Longtitude       18.278337
Regionname        0.004247
Propertycount     0.004247
dtype: float64

In [28]:
data.Price.head(30)

0           NaN
1     1480000.0
2     1035000.0
3           NaN
4     1465000.0
5      850000.0
6     1600000.0
7           NaN
8           NaN
9           NaN
10     941000.0
11    1876000.0
12          NaN
13          NaN
14    1636000.0
15    1000000.0
16     745000.0
17     300000.0
18    1097000.0
19     542000.0
20          NaN
21     760000.0
22     481000.0
23     700000.0
24    1350000.0
25     750000.0
26    1985000.0
27     500000.0
28    1172500.0
29     441000.0
Name: Price, dtype: float64

In [29]:
# As Price is continuous variable ,missing values can be replaced by mean or median of the column.

In [30]:
print('Mean of price column is:',data['Price'].mean())
print('Median of price column is:',data['Price'].median())

Mean of price column is: 1056697.4609154165
Median of price column is: 880000.0

In [31]:
# filling null values by mean of continuous type of data
data.Price.fillna(data['Price'].mean(),inplace=True)

In [32]:
data.isnull().sum()*100/len(data)

Suburb            0.000000
Address           0.000000
Rooms             0.000000
Type              0.000000
Price             0.000000
Method            0.000000
SellerG           0.000000
Date              0.000000
Distance          0.004247
Postcode          0.004247
Bedroom2         19.030025
Bathroom         19.042766
Car              19.645815
Landsize         26.062768
Lattitude        18.278337
Longtitude       18.278337
Regionname        0.004247
Propertycount     0.004247
dtype: float64

In [33]:
data.dtypes

Suburb            object
Address           object
Rooms            float64
Type              object
Price            float64
Method            object
SellerG           object
Date              object
Distance         float64
Postcode         float64
Bedroom2         float64
Bathroom         float64
Car              float64
Landsize         float64
Lattitude        float64
Longtitude       float64
Regionname        object
Propertycount    float64
dtype: object

In [34]:
for col in data.columns:
    if data[col].dtype=='float64':
        data[col].fillna(data[col].mean(),inplace=True)

In [35]:
# filling null value with mode of categorical data 
data.Regionname.fillna('Southern Metropolitan',inplace=True)

In [36]:
data.isnull().sum()

Suburb           0
Address          0
Rooms            0
Type             0
Price            0
Method           0
SellerG          0
Date             0
Distance         0
Postcode         0
Bedroom2         0
Bathroom         0
Car              0
Landsize         0
Lattitude        0
Longtitude       0
Regionname       0
Propertycount    0
dtype: int64

In [37]:
data.Regionname.mode()

0    Southern Metropolitan
dtype: object

In [38]:
# Printing removed columns and percentage of that
print('Number of columns removed are: 3')
print('Percentage of columns removed are :',3*100/21)

Number of columns removed are: 3
Percentage of columns removed are : 14.285714285714286

In [39]:
#Printing removed rows
print('No. of rows removed are:',23678-len(data))

No. of rows removed are: 131

The amount of data which lost was containing more than 30% of missing values so it was necessary to remove them. If null data would have been replaced with any value then data could have not been inappropriate. So the final data justifies.